// Завдання 4: Перетворення температури
// ---------------------------------------------------------------------------------------------
// Написати програму на C, яка буде перекладати температуру зі шкали Цельсія у шкалу Фаренгейта.
// Програма повинна приймати значення температури в Цельсіях з консолі за допомогою scanf і
// виводити результат у Фаренгейтах за допомогою printf.
// =============================================================================================
#include <stdio.h>

int main()
{
    float celsius, fahrenheit; // degrees celsius and fahrenheit

    // Input degrees celsius
    printf("\nEnter degrees Celsius: ");
    scanf("%f", &celsius);

    // Formula
    fahrenheit = (celsius * 9 / 5) + 32;

    // Output
    printf("\nResult: %.2f --> %.2f\n\n", celsius, fahrenheit);

    return 0;
}