// Завдання 5: Приклад з математики
// ----------------------------------------------------------------------
// дивіться на картинку. Напишіть скріпт якій зможе вирішити цей приклад.
// Спробуйте підключити бібліотеку math.h для полегшення обчислень
// a=3
// b=4.5
// c=16
// d=2.7
// e=5
// f=25.2
// g=2.4
// h=6
// ======================================================================
#include <stdio.h>
#include <math.h>

int main()
{
    float a, b, c, d, e, f, g, h, y; // numbers

    // Initialization of numbers
    a = 3;
    b = 4.5;
    c = 16;
    d = 2.7;
    e = 5;
    f = 25.2;
    g = 2.4;
    h = 6;

    // Formula
    y = ((log(sqrt(a * a + b * b)) + sqrt(c * d)) / (e * sqrt(f))) - log(g + h);

    // Output
    printf("\nResult --> %f\n\n", y);

    return 0;
}