// Завдання 3: Обчислення дискримінанту
// ---------------------------------------------------------------------------------------------
// Написати програму на мові C, яка дозволяє обчислити дискримінант квадратного рівняння.
// Програма повинна приймати коефіцієнти a, b та c з консолі та виводити значення дискримінанту.
// =============================================================================================
#include <stdio.h>

int main()
{
    double a, b, c; // numbers for formula

    // Input
    printf("\nEnter a, b and c using space: ");
    scanf("%lf %lf %lf", &a, &b, &c);

    printf("\n");

    // Formula
    double D = b * b - 4 * a * c;

    // Result
    printf("Result: %.2f\n\n", D);

    return 0;
}